GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/applications/jt808_camera.c
/************************************************************
 * Copyright (C), 2008-2012,
 * FileName:		// 文件名
 * Author:			// 作者
 * Date:			// 日期
 * Description:		// 模块描述
 * Version:			// 版本信息
 * Function List:	// 主要函数及其功能
 *     1. -------
 * History:			// 历史修改记录
 *     <author>  <time>   <version >   <desc>
 *     David    96/10/12     1.0     build this moudle
 ***********************************************************/
#include <stdio.h>
#include <rtthread.h>
#include <rtdevice.h>
#include <dfs_posix.h>

#include "stm32f4xx.h"
#include "rs485.h"
#include "jt808.h"
#include "camera.h"
#include "jt808_camera.h"
#include <finsh.h>
#include "sst25.h"

typedef __packed struct
{
	u32 Address;        ///地址
	u32 Data_ID;        ///数据ID
	u8	Delete;         ///删除标记
	u8	Pack_Mark[16];  ///包标记
}TypePicMultTransPara;


/*********************************************************************************
  *函数名称:u16 Cam_add_tx_pic_getdata( JT808_TX_NODEDATA * nodedata )
  *功能描述:在jt808_tx_proc当状态为GET_DATA时获取照片数据，该函数是 JT808_TX_NODEDATA 的 get_data 回调函数
  *输 入:	nodedata	:正在处理的发送链表
  *输 出: none
  *返 回 值:rt_err_t
  *作 者:白养民
  *创建日期:2013-06-16
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
static u16 Cam_add_tx_pic_getdata( JT808_TX_NODEDATA * nodedata )
{
	JT808_TX_NODEDATA		* iterdata	= nodedata;
	TypePicMultTransPara	* p_para	= (TypePicMultTransPara*)nodedata->user_para;
	TypeDF_PackageHead		TempPackageHead;
	uint16_t				i, wrlen, pack_num;
	uint16_t				body_len; /*消息体长度*/
	uint8_t					* msg;
	uint32_t				tempu32data;
	u16						ret = 0;

	//释放原来的资源
	rt_free( iterdata->tag_data );
	iterdata->tag_data	= RT_NULL;
	iterdata->msg_len	= 0;
	//查找当前图片是否存在
	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * 2 );
	tempu32data = Cam_Flash_FindPicID( p_para->Data_ID, &TempPackageHead );
	if( tempu32data == 0xFFFFFFFF )
	{
		rt_kprintf( "\r\n 没有找到图片，ID=%d", p_para->Data_ID );
		ret = 0xFFFF; goto FUNC_RET;
	}
	for( i = 0; i < iterdata->packet_num; i++ )
	{
		if( p_para->Pack_Mark[i / 8] & BIT( i % 8 ) )
		{
			if( i + 1 < iterdata->packet_num )
			{
				body_len = JT808_PACKAGE_MAX;
			}else
			{
				body_len = iterdata->size - JT808_PACKAGE_MAX * i;
			}
			iterdata->tag_data = rt_malloc( body_len + 16 );
			if( RT_NULL == iterdata->tag_data )
			{
				rt_kprintf( "\r\n Cam_add_tx_pic_getdata rt_malloc error!" );
				ret = 0; goto FUNC_RET;
			}
			iterdata->msg_len	= body_len;                                                             ///发送数据的长度等于消息体成都
			iterdata->packet_no = i + 1;
			iterdata->head_sn	= 0xF001 + i;
			wrlen				= jt808_add_mult_tx_head( iterdata );
			iterdata->msg_len	+= wrlen;                                                               ///发送数据的长度加上消息头的长度
			if( i == 0 )
			{
				sst25_read( tempu32data, (u8*)&TempPackageHead, sizeof( TypeDF_PackageHead ) );
				wrlen	+= data_to_buf( iterdata->tag_data + wrlen, TempPackageHead.Data_ID, 4 );       ///多媒体ID
				wrlen	+= data_to_buf( iterdata->tag_data + wrlen, TempPackageHead.Media_Style, 1 );   ///多媒体类型
				wrlen	+= data_to_buf( iterdata->tag_data + wrlen, TempPackageHead.Media_Format, 1 );  ///多媒体格式编码
				wrlen	+= data_to_buf( iterdata->tag_data + wrlen, TempPackageHead.TiggerStyle, 1 );   ///事件项编码
				wrlen	+= data_to_buf( iterdata->tag_data + wrlen, TempPackageHead.Channel_ID, 1 );    ///通道 ID
				memcpy( iterdata->tag_data + wrlen, TempPackageHead.position, 28 );                     ///位置信息汇报
				wrlen += 28;
				sst25_read( tempu32data + 64, iterdata->tag_data + wrlen, body_len - wrlen );
			}else
			{
				tempu32data = tempu32data + JT808_PACKAGE_MAX * i + 64 - 36;
				sst25_read( tempu32data, iterdata->tag_data + wrlen, body_len );
			}
			p_para->Pack_Mark[i / 8] &= ~( BIT( i % 8 ) );
			rt_kprintf( "\r\n cam_get_data ok\r\n PAGE=%d", iterdata->packet_no );
			ret = iterdata->packet_no; goto FUNC_RET;
		}
	}
	rt_kprintf( "\r\n cam_get_data_false!" );
	ret = 0;
FUNC_RET:
	rt_sem_release( &sem_dataflash );
	return ret;
}

/*********************************************************************************
  *函数名称:JT808_MSG_STATE Cam_jt808_timeout( JT808_TX_NODEDATA * nodedata )
  *功能描述:发送图片相关数据的超时处理函数
  *输 入:	nodedata	:正在处理的发送链表
  *输 出: none
  *返 回 值:JT808_MSG_STATE
  *作 者:白养民
  *创建日期:2013-06-16
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
static JT808_MSG_STATE Cam_jt808_timeout( JT808_TX_NODEDATA * nodedata )
{
	u16 cmd_id;
	cmd_id = nodedata->head_id;
	switch( cmd_id )
	{
		case 0x800:
		{
			rt_free( nodedata->user_para );
			nodedata->user_para = RT_NULL;
			break;
		}
		default:
		{
			break;
		}
	}
	rt_kprintf( "\r\n Cam_tx_timeout" );
	return ACK_OK;
}

/*********************************************************************************
  *函数名称:JT808_MSG_STATE Cam_jt808_0x801_response( JT808_TX_NODEDATA * nodedata , uint8_t *pmsg )
  *功能描述:在jt808中处理照片数据传输ACK_ok函数，该函数是 JT808_TX_NODEDATA 的 cb_tx_response 回调函数
  *输 入:	nodedata	:正在处理的发送链表
  *输 出: none
  *返 回 值:JT808_MSG_STATE
  *作 者:白养民
  *创建日期:2013-06-16
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
static JT808_MSG_STATE Cam_jt808_0x0801_response( JT808_TX_NODEDATA * nodedata, uint8_t *pmsg )
{
	JT808_TX_NODEDATA		* iterdata = nodedata;
	TypePicMultTransPara	* p_para;
	uint16_t				temp_msg_id;
	uint16_t				temp_msg_len;
	uint16_t				i, pack_num;
	uint16_t				body_len; /*消息体长度*/
	uint8_t					* msg;
	uint32_t				tempu32data;

	if( NULL == pmsg )
	{
		tempu32data = Cam_add_tx_pic_getdata( nodedata );
		if( tempu32data == 0xFFFF )
		{
			return ACK_OK;
		}else if( tempu32data == 0 )
		{
			return WAIT_ACK;
		}else
		{
			return IDLE;
		}
	}

	temp_msg_id = buf_to_data( pmsg, 2 );
	body_len	= buf_to_data( pmsg + 2, 2 ) & 0x3FF;
	msg			= pmsg + 12;
	if( 0x8001 == temp_msg_id )         ///通用应答
	{
		if( ( nodedata->head_sn == buf_to_data( msg, 2 ) ) && ( nodedata->head_id == buf_to_data( msg + 2, 2 ) ) && ( msg[4] == 0 ) )
		{
			nodedata->retry = 0;
			return IDLE;
		}
	}else if( 0x8800 == temp_msg_id )   ///专用应答
	{
		tempu32data = buf_to_data( msg, 4 );
		msg			+= 4;
		p_para		= (TypePicMultTransPara*)( iterdata->user_para );
		if( tempu32data == p_para->Data_ID )
		{
			memset( p_para->Pack_Mark, 0, sizeof( p_para->Pack_Mark ) );
			if( body_len >= 7 )
			{
				pack_num = *msg++;
				for( i = 0; i < pack_num; i++ )
				{
					tempu32data = buf_to_data( msg, 2 );
					if( tempu32data )
					{
						tempu32data--;
					}
					msg									+= 2;
					p_para->Pack_Mark[tempu32data / 8]	|= BIT( tempu32data % 8 );
				}
				rt_kprintf( "\r\n Cam_jt808_0x801_response\r\n lost_pack=%d", pack_num );
				nodedata->retry = 0;
				return IDLE;
			}else
			{
				if( p_para->Delete )
				{
					//Cam_Flash_DelPic(p_para->Data_ID);
				}
				rt_kprintf( "\r\n Cam_add_tx_pic_response_ok!" );
				return ACK_OK;
			}
		}
	}else
	{
	}
	return nodedata->state;
}

/*********************************************************************************
  *函数名称:rt_err_t Cam_jt808_0x801(u32 mdeia_id ,u8 media_delete)
  *功能描述:添加一个多媒体图片到发送列表中
  *输 入:	mdeia_id	:照片id
   media_delete:照片传送结束后是否删除标记，非0表示删除
  *输 出: none
  *返 回 值:rt_err_t
  *作 者:白养民
  *创建日期:2013-06-16
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
rt_err_t Cam_jt808_0x0801( u32 mdeia_id, u8 media_delete )
{
	u16						i;
	u32						TempAddress;
	TypePicMultTransPara	* p_para;
	TypeDF_PackageHead		TempPackageHead;
	rt_err_t				rt_ret;

	///查找多媒体ID是否存在
	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * 2 );
	TempAddress = Cam_Flash_FindPicID( mdeia_id, &TempPackageHead );
	rt_sem_release( &sem_dataflash );
	if( TempAddress == 0xFFFFFFFF )
	{
		return RT_ERROR;
	}
	///分配多媒体私有资源
	p_para = rt_malloc( sizeof( TypePicMultTransPara ) );
	if( p_para == NULL )
	{
		return RT_ERROR;
	}
	memset( p_para, 0xFF, sizeof( TypePicMultTransPara ) );
	///填充用户区数据

	p_para->Address = TempAddress;
	p_para->Data_ID = mdeia_id;
	p_para->Delete	= media_delete;
	//memset(p_para,0xFF,sizeof(p_para->Pack_Mark));

	rt_ret = jt808_add_mult_tx_node( 1,
	                                 SINGLE_CMD,
	                                 0x801,
	                                 TempPackageHead.Len - 64 + 36,
	                                 0xF001,
	                                 Cam_jt808_timeout,
	                                 Cam_jt808_0x0801_response,
	                                 p_para );
	if( rt_ret == RT_EOK )
	{
		rt_kprintf( "\r\n Cam_add_tx_pic_ok!!!" );
	}
	return rt_ret;
}

FINSH_FUNCTION_EXPORT( Cam_jt808_0x0801, Cam_jt808_0x0801 );


/*********************************************************************************
  *函数名称:JT808_MSG_STATE Cam_jt808_0x801_response( JT808_TX_NODEDATA * nodedata , uint8_t *pmsg )
  *功能描述:在jt808中处理照片数据传输ACK_ok函数，该函数是 JT808_TX_NODEDATA 的 cb_tx_response 回调函数
  *输 入:	nodedata	:正在处理的发送链表
  *输 出: none
  *返 回 值:JT808_MSG_STATE
  *作 者:白养民
  *创建日期:2013-06-16
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
static JT808_MSG_STATE Cam_jt808_0x0800_response( JT808_TX_NODEDATA * nodedata, uint8_t *pmsg )
{
	JT808_TX_NODEDATA		* iterdata = nodedata;
	TypePicMultTransPara	* p_para;
	TypeDF_PackageHead		TempPackageHead;
	uint32_t				TempAddress;
	uint16_t				temp_msg_id;
	uint16_t				body_len; /*消息体长度*/
	uint8_t					* msg;
	if( pmsg == RT_NULL )
	{
		return IDLE;
	}

	printer_data_hex( pmsg, 17 );

	temp_msg_id = buf_to_data( pmsg, 2 );
	body_len	= buf_to_data( pmsg + 2, 2 ) & 0x3FF;
	msg			= pmsg + 12;
	if( 0x8001 == temp_msg_id ) ///通用应答
	{
		if( ( nodedata->head_sn == buf_to_data( msg, 2 ) ) && ( nodedata->head_id == buf_to_data( msg + 2, 2 ) ) && ( msg[4] == 0 ) )
		{
			p_para = nodedata->user_para;
			rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * 2 );
			TempAddress = Cam_Flash_FindPicID( p_para->Data_ID, &TempPackageHead );
			rt_sem_release( &sem_dataflash );
			if( TempAddress == 0xFFFFFFFF )
			{
				return ACK_OK;
			}
			nodedata->size			= TempPackageHead.Len - 64 + 36;
			nodedata->multipacket	= 1;
			nodedata->type			= SINGLE_CMD;
			nodedata->state			= IDLE;
			nodedata->retry			= 0;
			nodedata->packet_num	= ( nodedata->size / JT808_PACKAGE_MAX );
			if( nodedata->size % JT808_PACKAGE_MAX )
			{
				nodedata->packet_num++;
			}
			nodedata->packet_no = 0;
			nodedata->msg_len	= 0;
			//nodedata->user_para   = p_para;
			nodedata->head_id			= 0x801;
			nodedata->head_sn			= 0xF001;
			nodedata->tag_data			= RT_NULL;
			nodedata->tick				= 0;
			nodedata->timeout			= 0;
			nodedata->cb_tx_timeout		= Cam_jt808_timeout;
			nodedata->cb_tx_response	= Cam_jt808_0x0801_response;

			return IDLE;
		}
	}
	return IDLE;
}

/*********************************************************************************
  *函数名称:void Cam_jt808_0x800(TypeDF_PackageHead *phead)
  *功能描述:多媒体事件信息上传_发送照片多媒体信息
  *输	入:	phead	:照片信息信息
  *输	出:	none
  *返 回 值:rt_err_t
  *作	者:白养民
  *创建日期:2013-06-16
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
rt_err_t Cam_jt808_0x0800( u32 mdeia_id, u8 media_delete )
{
	u8						ptempbuf[32];
	u16						datalen = 0;
	u16						i;
	u32						TempAddress;
	TypePicMultTransPara	* p_para;
	TypeDF_PackageHead		TempPackageHead;
	rt_err_t				rt_ret;

	///查找多媒体ID是否存在
	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * 2 );
	TempAddress = Cam_Flash_FindPicID( mdeia_id, &TempPackageHead );
	rt_sem_release( &sem_dataflash );
	if( TempAddress == 0xFFFFFFFF )
	{
		return RT_ERROR;
	}
	///分配多媒体私有资源
	p_para = rt_malloc( sizeof( TypePicMultTransPara ) );
	if( p_para == NULL )
	{
		return RT_ERROR;
	}
	///填充用户区数据
	memset( p_para, 0xFF, sizeof( TypePicMultTransPara ) );
	p_para->Address = TempAddress;
	p_para->Data_ID = mdeia_id;
	p_para->Delete	= media_delete;

	datalen += data_to_buf( ptempbuf + datalen, TempPackageHead.Data_ID, 4 );
	datalen += data_to_buf( ptempbuf + datalen, TempPackageHead.Media_Style, 1 );
	datalen += data_to_buf( ptempbuf + datalen, TempPackageHead.Media_Format, 1 );
	datalen += data_to_buf( ptempbuf + datalen, TempPackageHead.TiggerStyle, 1 );
	datalen += data_to_buf( ptempbuf + datalen, TempPackageHead.Channel_ID, 1 );
	//return jt808_tx(0x800,ptempbuf,datalen);
	rt_ret = jt808_add_tx_data( 1,
	                            SINGLE_CMD,
	                            0x800,
	                            datalen,
	                            -1,
	                            Cam_jt808_timeout,
	                            Cam_jt808_0x0800_response,
	                            ptempbuf,
	                            p_para );
	if( rt_ret == RT_EOK )
	{
		rt_kprintf( "\r\n Cam_jt808_0x800" );
	}
	return rt_ret;
}

/*********************************************************************************
  *函数名称:void Cam_jt808_0x8801_cam_ok( struct _Style_Cam_Requset_Para *para,uint32_t pic_id )
  *功能描述:平台下发拍照命令处理函数的回调函数_单张照片拍照OK
  *输	入:	para	:拍照处理结构体
   pic_id	:图片ID
  *输	出:	none
  *返 回 值:rt_err_t
  *作	者:白养民
  *创建日期:2013-06-17
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
void Cam_jt808_0x8801_cam_ok( struct _Style_Cam_Requset_Para *para, uint32_t pic_id )
{
	u8	*pdestbuf;
	u16 datalen = 0;

	pdestbuf = (u8*)para->user_para;

	if( ( para->PhotoNum <= para->PhotoTotal ) && ( para->PhotoNum ) && ( para->PhotoNum <= 32 ) )
	{
		datalen = ( para->PhotoNum - 1 ) * 4 + 5;
	}else
	{
		return;
	}
	data_to_buf( pdestbuf + datalen, pic_id, 4 ); ///写入应答流水号
	rt_kprintf( "\r\n Cam_jt808_0x8801_cam_ok" );

	if( para->SendPhoto )
	{
		Cam_jt808_0x801( pic_id, !para->SavePhoto );
	}
}

/*********************************************************************************
  *函数名称:void Cam_jt808_0x8801_cam_end( struct _Style_Cam_Requset_Para *para )
  *功能描述:平台下发拍照命令处理函数的回调函数
  *输	入:	para	:拍照处理结构体
  *输	出:	none
  *返 回 值:rt_err_t
  *作	者:白养民
  *创建日期:2013-06-17
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
void Cam_jt808_0x8801_cam_end( struct _Style_Cam_Requset_Para *para )
{
	u8	*pdestbuf;
	u16 datalen;

	pdestbuf = (u8*)para->user_para;
	if( ( para->PhotoNum <= para->PhotoTotal ) && ( para->PhotoNum ) && ( para->PhotoNum <= 32 ) )
	{
		pdestbuf[2] = 0;
		datalen		= para->PhotoNum * 4 + 5;
	}else
	{
		pdestbuf[2] = 1;
		datalen		= 5;
	}
	data_to_buf( pdestbuf + 3, para->PhotoNum, 2 ); ///写入应答流水号

	jt808_tx_ack( 0x805, pdestbuf, datalen );

