GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/applications/jt808_camera.c
	rt_kprintf( "\r\n 拍照结束发送808数据:\r\n" );
	printer_data_hex( pdestbuf, datalen );
	rt_kprintf( "\r\n" );

	rt_free( para->user_para );
	para->user_para = RT_NULL;
	rt_kprintf( "\r\nCam_jt808_0x8801_cam_end" );

	return;
}

/*********************************************************************************
  *函数名称:rt_err_t Cam_jt808_0x8801(uint8_t linkno,uint8_t *pmsg)
  *功能描述:平台下发拍照命令处理函数
  *输	入:	pmsg	:808消息体数据
   msg_len	:808消息体长度
  *输	出:	none
  *返 回 值:rt_err_t
  *作	者:白养民
  *创建日期:2013-06-17
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
rt_err_t Cam_jt808_0x8801( uint8_t linkno, uint8_t *pmsg )
{
	u8						*ptempbuf;
	u8						*pdestbuf;
	u16						datalen;
	u16						i, mediatotal;
	TypeDF_PackageHead		TempPackageHead;
	Style_Cam_Requset_Para	cam_para;
	u32						Tempu32data;
	rt_err_t				ret;

	u16						msg_len;
	u16						fram_num;

	msg_len		= buf_to_data( pmsg + 2, 2 ) & 0x3FF;
	fram_num	= buf_to_data( pmsg + 10, 2 );
	pmsg		+= 12;

	if( msg_len < 12 )
	{
		return RT_ERROR;
	}
	memset( &cam_para, 0, sizeof( cam_para ) );

	///设置触发类型为平台触发
	cam_para.TiggerStyle = Cam_TRIGGER_PLANTFORM;

	///通道 ID 1BYTE
	datalen				= 0;
	cam_para.Channel_ID = pmsg[datalen++];
	///拍摄命令 2BYTE
	Tempu32data = buf_to_data( pmsg + datalen, 2 );
	datalen		+= 2;
	if( ( Tempu32data ) && ( Tempu32data != 0xFFFF ) )
	{
		cam_para.PhotoTotal = Tempu32data;
		if( cam_para.PhotoTotal > 32 )
		{
			cam_para.PhotoTotal = 32;
		}
	}else
	{
		return RT_ERROR;
	}
	///拍照间隔/录像时间 2BYTE second
	Tempu32data			= buf_to_data( pmsg + datalen, 2 );
	datalen				+= 2;
	cam_para.PhoteSpace = Tempu32data * RT_TICK_PER_SECOND;
	///保存标志
	if( pmsg[datalen++] )
	{
		cam_para.SavePhoto	= 1;
		cam_para.SendPhoto	= 0;
	}else
	{
		cam_para.SavePhoto	= 0;
		cam_para.SendPhoto	= 1;
	}
	///和用户回调函数相关的数据参数
	datalen		= cam_para.PhotoTotal * 4 + 5;
	pdestbuf	= rt_malloc( datalen );
	if( pdestbuf == RT_NULL )
	{
		return RT_ERROR;
	}
	memset( pdestbuf, 0, datalen );         ///清空数据
	data_to_buf( pdestbuf, fram_num, 2 );   ///写入应答流水号
	cam_para.user_para = (void*)pdestbuf;
	///一张照片拍照成功回调函数
	cam_para.cb_response_cam_ok = Cam_jt808_0x8801_cam_ok;
	///所有照片拍照结束回调函数
	cam_para.cb_response_cam_end = Cam_jt808_0x8801_cam_end;

	///发送拍照请求
	take_pic_request( &cam_para );
	return RT_EOK;
}

typedef struct _pic_search_param
{
	uint8_t type;   /*类型*/
	uint8_t chn;    /*通道*/
	uint8_t event;  /*时间项编码*/
	MYTIME start;  /*开始时刻*/
	MYTIME end;    /*结束时刻*/
	MYTIME curr;   /*当前要搜索的时刻*/
}PIC_SEARCH_PARAM;


/*********************************************************************************
  *函数名称:rt_err_t Cam_jt808_0x8802(uint8_t linkno,uint8_t *pmsg)
  *功能描述:存储多媒体数据检索
  *输	入:	pmsg	:808消息体数据
   msg_len	:808消息体长度
  *输	出:none
  *返 回 值:rt_err_t
  *作	者:白养民
  *创建日期:2013-06-16
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
rt_err_t Cam_jt808_0x8802( uint8_t linkno, uint8_t *pmsg )
{
	u8					*ptempbuf;
	u8					*pdestbuf;
	u16					datalen = 0;
	u16					i, mediatotal;
	TypeDF_PackageHead	TempPackageHead;
	u32					TempAddress;
	rt_err_t			ret;

	u16					msg_len;
	u16					fram_num;

	uint8_t				* psrc = pmsg;
	uint16_t			seq, len;
	uint32_t			i;
	MYTIME				start, end;
	PIC_SEARCH_PARAM	* puserdata;
	uint8_t				* pdata;

	i = ( psrc[2] << 8 ) | psrc[3]; /*长度，默认不是多包*/
	if( i != 15 )
	{
		return RT_ERROR;
	}

	puserdata = rt_malloc( sizeof( PIC_SEARCH_PARAM ) );
	if( puserdata == RT_NULL )
	{
		rt_free(ptempbuf);
		return RT_ENOMEM;
	}

	puserdata->type	= psrc[12];
	puserdata->chn	= psrc[13];
	puserdata->event = psrc[14];
	puserdata->start = (T_TIMES*)( psrc + 15 );
	puserdata->end	= (T_TIMES*)( psrc + 21 );
	puserdata->curr	= puserdata.start;

	///查找符合条件的图片，并将图片地址存入ptempbuf中
	mediatotal = Cam_Flash_SearchPic( (T_TIMES*)( pmsg + 3 ), (T_TIMES*)( pmsg + 9 ), &TempPackageHead, ptempbuf );

	if( mediatotal > 16 ) /*去掉了多包的情况*/
	{
		/*每个图片项 35字节，单数据包16个 4个字节的应答头*/
		pdata = node_begin( 1, MULTI_ACK, 0x0802, ( psrc[10] << 8 ) | psrc[11], 35 * 16 + 4 );
	}else
	{
		pdata = node_begin( 1, SINGLE_ACK, 0x0802, ( psrc[10] << 8 ) | psrc[11], 35 * 16 + 4 );
	}
	
	if( pdata == RT_NULL )
	{
		rt_free( puserdata );
		return RT_ENOMEM;
	}

	datalen += data_to_buf( pdestbuf + datalen, fram_num, 2 );
	datalen += data_to_buf( pdestbuf + datalen, mediatotal, 2 );
	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * 2 );
	for( i = 0; i < mediatotal; i++ )
	{
		TempAddress = buf_to_data( ptempbuf, 4 );
		ptempbuf	+= 4;
		sst25_read( TempAddress, (u8*)&TempPackageHead, sizeof( TempPackageHead ) );
		datalen += data_to_buf( pdestbuf + datalen, TempPackageHead.Data_ID, 4 );
		datalen += data_to_buf( pdestbuf + datalen, TempPackageHead.Media_Style, 1 );
		datalen += data_to_buf( pdestbuf + datalen, TempPackageHead.Channel_ID, 1 );
		datalen += data_to_buf( pdestbuf + datalen, TempPackageHead.TiggerStyle, 1 );
		memcpy( pdestbuf + datalen, TempPackageHead.position, 28 ); ///位置信息汇报
		datalen += 28;
	}
	rt_sem_release( &sem_dataflash );
	ret = jt808_tx_ack( 0x0802, pdestbuf, datalen );

	rt_free( ptempbuf );
	rt_free( pdestbuf );
	return ret;
}

#if 0


/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
rt_err_t Cam_jt808_0x8802( uint8_t linkno, uint8_t *pmsg )
{
	u8					*ptempbuf;
	u8					*pdestbuf;
	u16					datalen = 0;
	u16					i, mediatotal;
	TypeDF_PackageHead	TempPackageHead;
	u32					TempAddress;
	rt_err_t			ret;

	u16					msg_len;
	u16					fram_num;

	msg_len		= buf_to_data( pmsg + 2, 2 ) & 0x3FF;
	fram_num	= buf_to_data( pmsg + 10, 2 );
	pmsg		+= 12;

	if( pmsg[0] )
	{
		return RT_ERROR;
	}

	ptempbuf = rt_malloc( Cam_get_state( ).Number * 4 );
	if( ptempbuf == NULL )
	{
		return RT_ERROR;
	}

